###### Read the following data set:
######  https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data

In [59]:
import pandas as pd
import numpy as np

In [60]:
#Load data from sample.csv to table
data = pd.read_csvdata = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', sep='\s*,\s*',header=None, encoding='ascii', engine='python')
data.columns = ['age', 'workclass', 'fnlwgt', 'education', 'education_num', 'marital_status', 'occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country', 'label']
data.head(5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,label
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

###### 1. Create an sqlalchemy engine using a sample from the data set

In [61]:
import sqlalchemy
from sqlalchemy import create_engine
alchEngine = create_engine('sqlite:///mydb', echo=False)
data.to_sql('mydb',alchEngine,if_exists='replace',chunksize=1000)

In [62]:
import sqlite3 as sql
conn  = sql.connect("mydb")
cur = conn.cursor()
cur.execute('select count(*) from mydb')
print(cur.fetchall())

[(32561,)]

###### 2. Write two basic update queries

In [66]:
cur.execute('update mydb set age=55 where fnlwgt = 83311')
print(cur.fetchall())

[]

In [68]:
cur.execute('select * from  mydb where fnlwgt = 83311')
print(cur.fetchall())

[(1, 55, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 0, 0, 13, 'United-States', '<=50K'), (16474, 55, 'Self-emp-not-inc', 83311, 'Prof-school', 15, 'Married-civ-spouse', 'Prof-specialty', 'Husband', 'White', 'Male', 0, 0, 30, 'United-States', '>50K')]

In [74]:
cur.execute('select count(*) from  mydb  where education_num = 13')
print("Before update ")
print(cur.fetchall())
cursor.execute('update mydb1 set education_num = 113  where education_num = 13')
print(cursor.fetchall())

Before update
[(0,)]

In [96]:
#Verification
cur.execute('select * from  mydb  where education_num = 113 limit 3')
test= pd.DataFrame(cur.fetchall())   
test

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,0,39,State-gov,77516,Bachelors,113,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,1,55,Self-emp-not-inc,83311,Bachelors,113,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,9,42,Private,159449,Bachelors,113,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

###### 3. Write two delete queries

In [77]:
cur.execute('select count(*) from  mydb  where fnlwgt=338409')
print(cur.fetchall())  
cur.execute('delete from mydb where fnlwgt=338409')
cur.execute('select count(*) from  mydb  where fnlwgt=338409')
print(cur.fetchall())

[(1,)]
[(0,)]

In [78]:
cur.execute('select count(*) from  mydb  where fnlwgt=234721')
print(cur.fetchall()) 
cur.execute('delete from mydb where fnlwgt=234721')
cur.execute('select count(*) from  mydb  where fnlwgt=234721')
print(cur.fetchall())

[(1,)]
[(0,)]

###### 4.Write two filter queries

In [81]:
cur.execute('select count(sex) from mydb where sex="Female" and marital_status="Never-married"')
print(cur.fetchall())

[(4767,)]

In [83]:
cur.execute('select count(sex) from mydb where sex="Male" and occupation="Adm-clerical"')
print(cur.fetchall())

[(1233,)]

###### 5.Write two function queries

In [87]:
def fab(n):
    a, b = 0, 1
    for _ in range(n):
        yield a
        a, b = b, a + b

In [92]:
cur.execute('CREATE TABLE IF NOT EXISTS fib (calculated_value INTEGER)')
cur.executemany('INSERT INTO fib VALUES (?)',[(str(x),) for x in fib(10)])

In [93]:
#run a sample query
cur.execute('SELECT * FROM fib')
print(cur.fetchall())

[(0,), (1,), (1,), (2,), (3,), (5,), (8,), (13,), (21,), (34,)]

In [95]:
def getRange(n):
    return np.arange(n)

cur.execute('CREATE TABLE IF NOT EXISTS Range (Number_Range INTEGER)')
cur.executemany('INSERT INTO Range VALUES (?)',[(str(x),) for x in getRange(6)])
#run a sample query
cur.execute('SELECT * FROM Range')
print(cur.fetchall())

[(0,), (1,), (2,), (3,), (4,), (5,)]

cur.close()
con.close()